Repository: tollwerk/TYPO3-ext-tw_lucenesearch
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de

# feplugin
source: Lucene search
de: Lucene-Suche

# feplugin.flex.behavior
source: Behavior
de: Verhalten

# feplugin.flex.display
source: Display
de: Darstellung

# feplugin.flex.search
source: Search box
de: Sucheingabe

# feplugin.flex.results
source: Search results
de: Suchergebnisse

# feplugin.flex.notfound
source: Error page search (404 Not found)
de: Fehlerseitensuche (404 Nicht gefunden)

# constants.file
source: Files & directories
de: Dateien & Verzeichnisse

# constants.file.be.templateRootPath
source: Path to template root (BE)
de: Pfad zum Template-Wurzelverzeichnis (BE)

# constants.file.be.partialRootPath
source: Path to template partials (BE)
de: Pfad zum Partial-Wurzelverzeichnis (BE)

# constants.file.be.layoutRootPath
source: Path to template layouts (BE)
de: Pfad zum Layouts-Wurzelverzeichnis (BE)

# constants.file.templateRootPath
source: Path to template root (FE):You can alter this in case you want to customize the templates
de: Pfad zum Template-Verzeichnis (FE):Wählen Sie ein benutzerdefiniertes Template-Verzeichnis, wenn sie die Vorlagen anpassen möchten

# constants.file.templateRootPath.paginate
source: Path to template root (FE) for paginate widget:You can alter this in case you want to customize the pagination widget
de: Pfad zum Template-Verzeichnis (FE):Wählen Sie ein benutzerdefiniertes Template-Verzeichnis, wenn sie das Paginierungs-Widget anpassen möchten

# constants.file.partialRootPath
source: Path to template partials (FE):You can alter this, though the standard plugin doesn't use partials ...
de: Pfad zum Partial-Verzeichnis (FE):Mit dieser Einstellung können Sie das Partial-Verzeichnis anpassen, wenngleich auch der Standard-Plugin keine Partials nutzt ...

# constants.file.layoutRootPath
source: Path to template layouts (FE):You can alter this, though the standard plugin doesn't use layouts ...
de: Pfad zum Layout-Verzeichnis (FE):Mit dieser Einstellung können Sie das Layout-Verzeichnis anpassen, wenngleich auch der Standard-Plugin keine Layouts nutzt ...

# constants.javascript.jquery
source: Include jQuery library:Convenience method for including the latest jQuery library of the version 1 branch into your source code (expects your main PAGE object being called "page", useless otherwise).
de: jQuery-Bibliothek einschließen:Bequeme Möglichkeit, um die aktuellste jQuery-1.x-Bibliothek in Ihren Quellcode einzubinden (setzt voraus, dass das zentrale PAGE-Objekt mit "page" benannt ist, andernfalls ist diese Option nutzlos).

# constants.javascript.searchboxJS
source: Include searchbox JavaScript:Includes a tiny JavaScript that prints "Your search terms ..." into the standard search box while it is not focused (please see manual for further information). The script relies on jQuery being present (so make sure to check the option above or include jQuery in any other suitable way) and your main PAGE object being called "page".
de: Suchfeld-JavaScript einschließen:Bindet ein einfaches JavaScript ein, das "Ihre Suchbegriffe ..." im Standard-Suchfeld anzeigt, solange dieses nicht fokusiert ist (weitere Infos in der Dokumentation). Das Skript setzt jQuery (bitte stellen Sie also sicher, dass die vorangehende Option aktiviert oder jQuery anderweitig verfügbar ist) sowie ein mit "page" benanntes zentrales PAGE-Objekt voraus.

# constants.javascript.autocompleteJS
source: Include autocomplete JavaScript:Includes an autocomplete jQuery library.
de: Autocomplete-JavaScript einschließen:Bindet eine jQuery-Bibliothek zur Autovervollständigung von Suchbegriffen ein

# constants.indexing
source: Indexing
de: Indizierung

# constants.indexing.reference
source: Document reference parameters:Comma separated list of GET variables that should be considered relevant for uniquely identifying and indexing your pages
de: Dokumentreferenz-Parameter:Kommaseparierte Liste von GET-Parametern, die benötigt werden, um Ihre Seite eindeutig referenzieren und indizieren zu können

# constants.indexing.timestamp
source: Inject modification timestamps:Whether to inject modification timestamps into the HTML source code of your pages (several meta tags)
de: Modifikationszeitstempel ausgeben:Aktivieren Sie diese Option, um automatisch Modifikationszeitstempel in den Quellcode Ihrer Seiten zu integrieren (mehrere Meta-Elemente)

# constants.indexing.languageReference
source: Document language reference parameter:GET variable that should be considered relevant for uniquely identifying your language
de: Dokumentsprachreferenz-Parameter:GET-Parameter, der benötigt wird, um die Sprache Ihrer Seite eindeutig identifizieren zu können

# constants.search
source: Search
de: Suche

# constants.search.rootline
source: Root pages:Enter comma separated list of page IDs that should be treated as root pages for search results (i.e. the search will only yield those pages or below as search results)
de: Wurzelseiten:Bitte geben Sie eine kommaseparierte Liste mit Seiten-IDs an, die als Wurzelseiten für Suchergebnisse herangezogen werden sollen (d.h. Suchvorgänge werden nur Seiten unterhalb dieser Wurzeln als Ergebnisse liefern)

# constants.search.language
source: Search results language:Whether to restrict the search results to the current frontend language
de: Sprache der Suchergebnisse:Aktivieren Sie diese Option, wenn nur Suchergebnisse geliefert werden sollen, die der aktuellen Frontendsprache entsprechen

# constants.search.types
source: Search types:Comma separated list of document types to search
de: Dokumenttypen:Kommaseparierte Liste der zu durchsuchenden Dokumenttypen

# constants.search.types.allow
source: Allowed page types:Comma separated list of allowed page types (typeNum values)
de: Erlaubte Seitentypen: Kommaseparierte Liste erlaubter Seitentypen (typeNum-Werte)

# constants.search.types.disallow
source: Disallowed page types:Comma separated list of disallowed page types (typeNum values; allowed types take precedence)
de: Unerlaubte Seitentypen: Kommaseparierte Liste unerlaubter Seitentypen (typeNum-Werte; erlaubte Werte haben Vorrang)

# constants.search.highlight
source: Highlight search terms:Whether to highlight the search terms in the search result list
de: Suchbegriffe hervorheben:Aktivieren Sie diese Option, um die angegebenen Suchbegriffe in der Ergebnisliste hervorzuheben

# constants.search.config
source: Page properties configuration:Configures the importance / relevance of single page properties for indexing and searching as well as the usage of global wildcards (see manual for details)
de: Seiteneigenschaftskonfiguration:Konfigurieren Sie mit dieser Option sowohl die Wichtigkeit / Relevanz einzelner Seiteneigenschaften für die Indizierung und Suche, als auch die Verwendung von Platzhaltern (weitere Infos siehe Dokumentation)

# constants.search.limits.query
source: Max. matched terms:Wildcard and fuzzy search queries may match too many terms, causing incredible search performance downgrade. Limiting the max. number of matches will help (0 means no limit)
de: Max. Ergebnisbegriffe:Platzhalter- und unscharfe Sucheanfragen können zu extrem vielen Suchergebnissen führen, was die Leistung der Suche erheblich beeinträchtigen kann. Durch die Einschränkung der maximal zu ermittelnden Ergebnistreffer kann entgegengewirkt werden (0 bedeutet kein Limit)

# constants.search.limits.display
source: Max. displayed results:Set the maximum of matching search results that are displayed at once
de: Max. Anzahl Suchergebnisse:Geben Sie die maximale Anzahl gleichzeitig dargestellter Ergebnistreffer an

# constants.search.chars
source: Character limit:Number of minimum chars to trigger a search
de: Zeichenlimit:Minimale Zeichenanzahl für Suchvorgänge

# constants.search.pid
source: Default results PID:ID of the page displaying search results by default
de: Standard-Ergebnisseite:ID der Seite, auf der die Suchergebnisse standardmäßig dargestellt werden

# constants.search.method
source: Search form method
de: Suchformular-Methode
